    internal class TODO
    {

    /*
     * + При загрузке списка участов и станков не обновлять сразу таблицы
     * + разделить алгоритмы смен на те, что для сотрудников и те, что для станков
     * параметры подключения в файле
     * 
     * 
     * для начальника и диспетчера сделать сделать автоприменение статуса (утверждено для кадровых изменений)
     * для мастера только назначение черновика
     * позже вцелом сделать разделение на роли!!! и авторизацию, чтобы неавторизованный пользователь мог только просматривать расстановку и план
     * 
     * 
     * !Карточка смены, сводная таблица смены
     * + В общей таблице смен отображать статус "без рабочего места" не только для плановых, но и для переназначенных
     * При назначении сотрудника занятого в текущей смене, но на другом станке, предлагать переназначить!!!
     * При переназначении сотрудника на другое рабочее место проверять работает ли новое рабочее место (не отменена ли работа, или работа только по назначению, а смена не назначена)
     * + пересмотреть активность кнопок и какие назначения можно отменить
     * + Запретить отменять смену сотрудника у которого плановый простой
     * + Не отображается назначенный сотрудник в день, когда у него выходной (например для пятидневки)
     * + Автопрокручиван ие на последнее место (или на текущую дату, если месяц текущий)
     * + (сделал полнойенны  перевод не только между рабояими местами, но и между сменами в рамках одной даты) Продумать, как отменять переевод в другую смену (когда одна смена отменяется, а другая назначается). может добавить столбец в котором будет индекс назначения, чтобы при возврате к исходному плану удалялось и назначение
     * + Подумать, как сделать перевод в другую смену (в одну дату), либо оставить как есть (отменяем вручную одну смену и назначаем в другую), либо сделаем флаг перевода, чтобы понимать, что это переназначение, а не дополнительная смена
     * Добавить возможность не переназначать на новое раб. место, а отображать сразу на двух станках (может как-то через флаг в таблице назначений)
     * подумать как сделать прикрепление к двум рабочим местам (один станок - две линии)
     * + Сделать вывод плана в главную таблицу расстановки персонала (заполнение второй строки )
     * ? Не отображать план для смены, которая отменена (пока отображаем)
     * Добавить вкладку со всеми назначениями, переводами и отменами
     *
     *
     *
     *
     * 
     * На карточку сотрудника добавить его текущще состояние (Больничный, отпуск и тд)
     * На карточку сотрудника добавить календарик с его сменами на текущий месяц
     * 
     * 
     * 
     * 
     * 
     * + Добавить сотрудников в план рабочего места (нужен запрос для вывода сотрудников определенного периода и определенного рабочего места)
     * + Не отображать в плане смену, которая отменена или вне плана (при условии, что нет заказов, которые начинались или заканчивались во время этой смены)
     * + Нужно еще доделать сьллбец для отображения штампа
     * + для разного оборудования сделать список отображаемых столбцов (см. план эксель)
     * 
     * 
     * 
     * 
     * + Список оборудования для отображения плана проверять наличие EquipCode - не загружаются рабочие места с пустым полем Code
     * 
     * 
     * Добавить окно списка причин отсутствия (добавление и редактирование)
     * Окно цветов заполнения таблицы
     * 
     * кнопки календарей карточки сотрудника, также сам календарь исправить сворачивание при изменении месяца
     * Окно с контактными данными. 
     * Доделать ввод и отображение контактных данных в карточке
     * 
     */
}
