    internal class TODO
    {

        /*
         * 
         * для начальника и диспетчера сделать сделать автоприменение статуса (утверждено для кадровых изменений)
         * для мастера только назначение черновика
         * позже вцелом сделать разделение на роли!!! и авторизацию, чтобы неавторизованный пользователь мог только просматривать расстановку и план
         * 
         * подумать как сделать прикрепление к двум рабочим местам (один станок - две линии)
         * 
         * пересмотреть активность кнопок и какие назначения можно отменить
         * + Запретить отменять смену сотрудника у которого плановый простой
         * + Не отображается назначенный сотрудник в день, когда у него выходной (например для пятидневки)
         * + Автопрокручиван ие на последнее место (или на текущую дату, если месяц текущий)
         * Продумать, как отменять переевод в другую смену (когда одна смена отменяется, а другая назначается). может добавить столбец в котором будет индекс назначения, чтобы при возврате к исходному плану удалялось и назначение
         * разделить алгоритмы смен на те, что для сотрудников и те, что для станков
         * На карточку сотрудника добавить его текущще состояние (Больничный, отпуск и тд)
         * На карточку сотрудника добавить календарик с его сменами на текущий месяц
         * 
         * Сделать вывод плана в главную таблицу расстановки персонала (заполнение второй строки )
         * Добавить сотрудников в план рабочего места (нужен запрос для вывода сотрудников определенного периода и определенного рабочего места)
         * 
         * Добавить окно списка причин отсутствия (добавление и редактирование)
         * Окно цветов заполнения таблицы
         * 
         * кнопки календарей карточки сотрудника, также сам календарь исправить
         * Окно с контактными данными. 
         * Доделать ввод и отображение контактных данных в карточке
         * 
         */
    }
